## Pandas 학습

1. 데이터 분석을 위한 모듈
- 데이터 분석 및 가공에 사용되는 파이썬 라이브러리
- 사용 빈도가 굉장히 높음
- Numpy 모듈 기반으로 생성됨

학습 내용

1. 기초 익히기
- 이미 존재하는 파일의 내용을 DataFrame 생성하기
- 중복 데이터 처리 기술
- 결측치 처리 하기
- 두개의 DataFraem 병합 : row/column기준

**주요 객체**
1. Series 
> A. DataFrame 구성 요소<br>B.구조가 하나의 column으로 구성(DataFrame의 하나의 컬럼)


2. DataFrame
> A.가로축과 세로축이 있는 엑셀과 유사한 구조<br>B.Series들로 구성

In [1]:
import numpy as np
import pandas as pd

In [2]:
!pip show pandas

Name: pandas
Version: 0.23.4
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: http://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: c:\users\playdata\anaconda3\lib\site-packages
Requires: python-dateutil, pytz, numpy
Required-by: seaborn, odo

기초 익히기

In [3]:
s = pd.Series([1, 2, 3])
s

0    1
1    2
2    3
dtype: int64

In [4]:
type(s)

pandas.core.series.Series

In [5]:
s.values

array([1, 2, 3], dtype=int64)

In [6]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [7]:
# 결측치 반영해 보기 
# nan - Not A Number
# 결측치 반영시 Series의 각 요소의 데이터 타입 - float64
s = pd.Series([1, np.nan, 3])
s

0    1.0
1    NaN
2    3.0
dtype: float64

In [8]:
# 특정 날짜를 기준으로 자동으로 날짜 증가
# 주의 사항 : yyyymmdd 형태
datas = pd.date_range('20181210', periods=6)
datas

DatetimeIndex(['2018-12-10', '2018-12-11', '2018-12-12', '2018-12-13',
               '2018-12-14', '2018-12-15'],
              dtype='datetime64[ns]', freq='D')

In [9]:
# DataFrame 생성 - 6행 4열
df = pd.DataFrame(np.random.randn(6, 4), index=datas)
df

                   0         1         2         3
2018-12-10  1.480347 -0.753262 -1.409142 -0.834644
2018-12-11 -0.322844  0.110642 -1.804601  1.454362
2018-12-12 -0.607500  0.947114 -0.504210  0.159644
2018-12-13  0.334072  1.040463  1.697106  0.674998
2018-12-14  0.438184 -1.246951  0.073584 -1.066743
2018-12-15  0.626324 -0.210573  1.875186  0.357547

In [10]:
df = pd.DataFrame(np.random.randn(6, 4), index=datas, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2018-12-10  1.287136  0.198447 -1.054903 -0.846296
2018-12-11 -0.653539 -1.622985  2.625608 -0.949073
2018-12-12  2.115943  0.332242  0.739265 -0.944312
2018-12-13  0.247772  1.144815 -0.083858 -0.154837
2018-12-14  0.087888 -1.261223 -1.998329 -1.451080
2018-12-15 -0.043940 -0.461682  0.482143 -0.901022

In [11]:
df.values

array([[ 1.28713601,  0.19844731, -1.05490299, -0.84629572],
       [-0.65353868, -1.62298505,  2.62560843, -0.94907291],
       [ 2.11594299,  0.33224201,  0.73926492, -0.94431183],
       [ 0.24777163,  1.14481473, -0.08385757, -0.15483679],
       [ 0.08788803, -1.26122309, -1.99832907, -1.45108017],
       [-0.04394013, -0.46168227,  0.48214256, -0.90102243]])

In [12]:
df.index

DatetimeIndex(['2018-12-10', '2018-12-11', '2018-12-12', '2018-12-13',
               '2018-12-14', '2018-12-15'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
# DataFrame의 구조 파악하는 함수
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2018-12-10 to 2018-12-15
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

<font color='blue'>정리 : Serias 생성 방법, yyyymmdd 및 기간을 기준으로 날짜 자동 생성하는 방법, DataFrame 객체 생성 방법, index 및 column 적용 방법, DataFrame의 정보 확인하는 방법</font>

In [15]:
df

                   A         B         C         D
2018-12-10  1.287136  0.198447 -1.054903 -0.846296
2018-12-11 -0.653539 -1.622985  2.625608 -0.949073
2018-12-12  2.115943  0.332242  0.739265 -0.944312
2018-12-13  0.247772  1.144815 -0.083858 -0.154837
2018-12-14  0.087888 -1.261223 -1.998329 -1.451080
2018-12-15 -0.043940 -0.461682  0.482143 -0.901022

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.506877 -0.278398  0.118321 -0.874437
std    1.009014  1.042425  1.593861  0.415281
min   -0.653539 -1.622985 -1.998329 -1.451080
25%   -0.010983 -1.061338 -0.812142 -0.947883
50%    0.167830 -0.131617  0.199142 -0.922667
75%    1.027295  0.298793  0.674984 -0.859977
max    2.115943  1.144815  2.625608 -0.154837

In [17]:
df

                   A         B         C         D
2018-12-10  1.287136  0.198447 -1.054903 -0.846296
2018-12-11 -0.653539 -1.622985  2.625608 -0.949073
2018-12-12  2.115943  0.332242  0.739265 -0.944312
2018-12-13  0.247772  1.144815 -0.083858 -0.154837
2018-12-14  0.087888 -1.261223 -1.998329 -1.451080
2018-12-15 -0.043940 -0.461682  0.482143 -0.901022

In [18]:
# B컬럼값을 기준으로 오름차순 정렬
# 오름차순 : ascending=True
# 내림차순 : ascending=False
df.sort_values(by='B', ascending=True)

                   A         B         C         D
2018-12-11 -0.653539 -1.622985  2.625608 -0.949073
2018-12-14  0.087888 -1.261223 -1.998329 -1.451080
2018-12-15 -0.043940 -0.461682  0.482143 -0.901022
2018-12-10  1.287136  0.198447 -1.054903 -0.846296
2018-12-12  2.115943  0.332242  0.739265 -0.944312
2018-12-13  0.247772  1.144815 -0.083858 -0.154837

In [19]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2018-12-13  0.247772  1.144815 -0.083858 -0.154837
2018-12-12  2.115943  0.332242  0.739265 -0.944312
2018-12-10  1.287136  0.198447 -1.054903 -0.846296
2018-12-15 -0.043940 -0.461682  0.482143 -0.901022
2018-12-14  0.087888 -1.261223 -1.998329 -1.451080
2018-12-11 -0.653539 -1.622985  2.625608 -0.949073

In [20]:
df

                   A         B         C         D
2018-12-10  1.287136  0.198447 -1.054903 -0.846296
2018-12-11 -0.653539 -1.622985  2.625608 -0.949073
2018-12-12  2.115943  0.332242  0.739265 -0.944312
2018-12-13  0.247772  1.144815 -0.083858 -0.154837
2018-12-14  0.087888 -1.261223 -1.998329 -1.451080
2018-12-15 -0.043940 -0.461682  0.482143 -0.901022

In [21]:
df['A']

2018-12-10    1.287136
2018-12-11   -0.653539
2018-12-12    2.115943
2018-12-13    0.247772
2018-12-14    0.087888
2018-12-15   -0.043940
Freq: D, Name: A, dtype: float64

In [22]:
type(df['A'])

pandas.core.series.Series

In [23]:
type(df)

pandas.core.frame.DataFrame

In [24]:
# DataFrrame의 row를 index로 slicing
#[0:3] - 0, 1, 2의 row
df[0:3]

                   A         B         C         D
2018-12-10  1.287136  0.198447 -1.054903 -0.846296
2018-12-11 -0.653539 -1.622985  2.625608 -0.949073
2018-12-12  2.115943  0.332242  0.739265 -0.944312

In [25]:
df

                   A         B         C         D
2018-12-10  1.287136  0.198447 -1.054903 -0.846296
2018-12-11 -0.653539 -1.622985  2.625608 -0.949073
2018-12-12  2.115943  0.332242  0.739265 -0.944312
2018-12-13  0.247772  1.144815 -0.083858 -0.154837
2018-12-14  0.087888 -1.261223 -1.998329 -1.451080
2018-12-15 -0.043940 -0.461682  0.482143 -0.901022

In [26]:
# index명으로 반환, 단 row의 번호와 달리 지정한 영역까지 반환
df['2018-12-10' : '2018-12-13']

                   A         B         C         D
2018-12-10  1.287136  0.198447 -1.054903 -0.846296
2018-12-11 -0.653539 -1.622985  2.625608 -0.949073
2018-12-12  2.115943  0.332242  0.739265 -0.944312
2018-12-13  0.247772  1.144815 -0.083858 -0.154837

In [27]:
df[0:4] #0~(4-1)

                   A         B         C         D
2018-12-10  1.287136  0.198447 -1.054903 -0.846296
2018-12-11 -0.653539 -1.622985  2.625608 -0.949073
2018-12-12  2.115943  0.332242  0.739265 -0.944312
2018-12-13  0.247772  1.144815 -0.083858 -0.154837

<font color="blue">정리 : DataFrame에서 일부 row값(index) 반환, index 번호, index명 </font>

loc 속성<br>
- 데이터를 slicing 기술<br>
- loc[index, columns]<br>

In [28]:
df

                   A         B         C         D
2018-12-10  1.287136  0.198447 -1.054903 -0.846296
2018-12-11 -0.653539 -1.622985  2.625608 -0.949073
2018-12-12  2.115943  0.332242  0.739265 -0.944312
2018-12-13  0.247772  1.144815 -0.083858 -0.154837
2018-12-14  0.087888 -1.261223 -1.998329 -1.451080
2018-12-15 -0.043940 -0.461682  0.482143 -0.901022

In [29]:
df.loc[:, ['A', 'B']]

                   A         B
2018-12-10  1.287136  0.198447
2018-12-11 -0.653539 -1.622985
2018-12-12  2.115943  0.332242
2018-12-13  0.247772  1.144815
2018-12-14  0.087888 -1.261223
2018-12-15 -0.043940 -0.461682

In [30]:
#2018-12-12	-0.259474	-1.579904
df.loc['2018-12-12', ['A', 'B']]

A    2.115943
B    0.332242
Name: 2018-12-12 00:00:00, dtype: float64

In [31]:
type(df.loc['2018-12-12', ['A', 'B']])

pandas.core.series.Series

iloc<br>
- loc와 달리 행과 열의 번호를 이용해서 데이터 활용

In [32]:
# index와 column의 숫자값으로 검색
df.iloc[[0, 1, 2], [0,1]]

                   A         B
2018-12-10  1.287136  0.198447
2018-12-11 -0.653539 -1.622985
2018-12-12  2.115943  0.332242

In [33]:
type(df.iloc[[0,1,2], [0,1]])

pandas.core.frame.DataFrame

In [34]:
df

                   A         B         C         D
2018-12-10  1.287136  0.198447 -1.054903 -0.846296
2018-12-11 -0.653539 -1.622985  2.625608 -0.949073
2018-12-12  2.115943  0.332242  0.739265 -0.944312
2018-12-13  0.247772  1.144815 -0.083858 -0.154837
2018-12-14  0.087888 -1.261223 -1.998329 -1.451080
2018-12-15 -0.043940 -0.461682  0.482143 -0.901022

문제 - 12월 12일의 B 컬럼값 반환, loc?/iloc? 따른 반환타입이 다름<br>
- loc - numpy의 float64 타입으로 반환<br>
- iloc - DataFrame 타입으로 반환<br>

In [35]:
df.loc['2018-12-12', 'B']

0.3322420100826921

In [36]:
type(df.loc['2018-12-12', 'B'])

numpy.float64

In [37]:
df.iloc[[2], [1]]

                   B
2018-12-12  0.332242

In [38]:
type(df.iloc[[2], [1]])

pandas.core.frame.DataFrame

조건식을 반영한 데이터 도출

In [39]:
df

                   A         B         C         D
2018-12-10  1.287136  0.198447 -1.054903 -0.846296
2018-12-11 -0.653539 -1.622985  2.625608 -0.949073
2018-12-12  2.115943  0.332242  0.739265 -0.944312
2018-12-13  0.247772  1.144815 -0.083858 -0.154837
2018-12-14  0.087888 -1.261223 -1.998329 -1.451080
2018-12-15 -0.043940 -0.461682  0.482143 -0.901022

In [40]:
df[df.A > 0]

                   A         B         C         D
2018-12-10  1.287136  0.198447 -1.054903 -0.846296
2018-12-12  2.115943  0.332242  0.739265 -0.944312
2018-12-13  0.247772  1.144815 -0.083858 -0.154837
2018-12-14  0.087888 -1.261223 -1.998329 -1.451080

In [41]:
df

                   A         B         C         D
2018-12-10  1.287136  0.198447 -1.054903 -0.846296
2018-12-11 -0.653539 -1.622985  2.625608 -0.949073
2018-12-12  2.115943  0.332242  0.739265 -0.944312
2018-12-13  0.247772  1.144815 -0.083858 -0.154837
2018-12-14  0.087888 -1.261223 -1.998329 -1.451080
2018-12-15 -0.043940 -0.461682  0.482143 -0.901022

In [42]:
# DataFrame 객체 복제해서 새로운 객체 생성해서 대입
df2 = df.copy()
df2

                   A         B         C         D
2018-12-10  1.287136  0.198447 -1.054903 -0.846296
2018-12-11 -0.653539 -1.622985  2.625608 -0.949073
2018-12-12  2.115943  0.332242  0.739265 -0.944312
2018-12-13  0.247772  1.144815 -0.083858 -0.154837
2018-12-14  0.087888 -1.261223 -1.998329 -1.451080
2018-12-15 -0.043940 -0.461682  0.482143 -0.901022

In [43]:
df2.iloc[0, 0]

1.2871360140211994

In [44]:
df2.iloc[0, 0] = 10

In [45]:
df2

                    A         B         C         D
2018-12-10  10.000000  0.198447 -1.054903 -0.846296
2018-12-11  -0.653539 -1.622985  2.625608 -0.949073
2018-12-12   2.115943  0.332242  0.739265 -0.944312
2018-12-13   0.247772  1.144815 -0.083858 -0.154837
2018-12-14   0.087888 -1.261223 -1.998329 -1.451080
2018-12-15  -0.043940 -0.461682  0.482143 -0.901022

In [46]:
df

                   A         B         C         D
2018-12-10  1.287136  0.198447 -1.054903 -0.846296
2018-12-11 -0.653539 -1.622985  2.625608 -0.949073
2018-12-12  2.115943  0.332242  0.739265 -0.944312
2018-12-13  0.247772  1.144815 -0.083858 -0.154837
2018-12-14  0.087888 -1.261223 -1.998329 -1.451080
2018-12-15 -0.043940 -0.461682  0.482143 -0.901022

In [47]:
df3 = df # df 객체의 주소값 즉 객체 지향 
df3.iloc[0,0] = 10
df3

                    A         B         C         D
2018-12-10  10.000000  0.198447 -1.054903 -0.846296
2018-12-11  -0.653539 -1.622985  2.625608 -0.949073
2018-12-12   2.115943  0.332242  0.739265 -0.944312
2018-12-13   0.247772  1.144815 -0.083858 -0.154837
2018-12-14   0.087888 -1.261223 -1.998329 -1.451080
2018-12-15  -0.043940 -0.461682  0.482143 -0.901022

In [48]:
df

                    A         B         C         D
2018-12-10  10.000000  0.198447 -1.054903 -0.846296
2018-12-11  -0.653539 -1.622985  2.625608 -0.949073
2018-12-12   2.115943  0.332242  0.739265 -0.944312
2018-12-13   0.247772  1.144815 -0.083858 -0.154837
2018-12-14   0.087888 -1.261223 -1.998329 -1.451080
2018-12-15  -0.043940 -0.461682  0.482143 -0.901022

In [49]:
# 이미 존재하는 DataFrame에 새로운 column 추가
df2['E'] = [1,2,3,4,np.nan,6]

In [50]:
df2

                    A         B         C         D    E
2018-12-10  10.000000  0.198447 -1.054903 -0.846296  1.0
2018-12-11  -0.653539 -1.622985  2.625608 -0.949073  2.0
2018-12-12   2.115943  0.332242  0.739265 -0.944312  3.0
2018-12-13   0.247772  1.144815 -0.083858 -0.154837  4.0
2018-12-14   0.087888 -1.261223 -1.998329 -1.451080  NaN
2018-12-15  -0.043940 -0.461682  0.482143 -0.901022  6.0

In [51]:
del df2['E']

In [52]:
df2

                    A         B         C         D
2018-12-10  10.000000  0.198447 -1.054903 -0.846296
2018-12-11  -0.653539 -1.622985  2.625608 -0.949073
2018-12-12   2.115943  0.332242  0.739265 -0.944312
2018-12-13   0.247772  1.144815 -0.083858 -0.154837
2018-12-14   0.087888 -1.261223 -1.998329 -1.451080
2018-12-15  -0.043940 -0.461682  0.482143 -0.901022

In [53]:
df2['E'] = [1,2,3,4,np.nan,6]

In [54]:
df2

                    A         B         C         D    E
2018-12-10  10.000000  0.198447 -1.054903 -0.846296  1.0
2018-12-11  -0.653539 -1.622985  2.625608 -0.949073  2.0
2018-12-12   2.115943  0.332242  0.739265 -0.944312  3.0
2018-12-13   0.247772  1.144815 -0.083858 -0.154837  4.0
2018-12-14   0.087888 -1.261223 -1.998329 -1.451080  NaN
2018-12-15  -0.043940 -0.461682  0.482143 -0.901022  6.0

In [55]:
# 해당 열에 데이터 존재 여부 검증하는 함수
df2['E'].isin([1,3,5,6])

2018-12-10     True
2018-12-11    False
2018-12-12     True
2018-12-13    False
2018-12-14    False
2018-12-15     True
Freq: D, Name: E, dtype: bool

In [56]:
df['A']

2018-12-10    10.000000
2018-12-11    -0.653539
2018-12-12     2.115943
2018-12-13     0.247772
2018-12-14     0.087888
2018-12-15    -0.043940
Freq: D, Name: A, dtype: float64

In [57]:
df['A'].max()

10.0

In [58]:
df['A'].min()

-0.6535386750585923

In [59]:
#? A 컬럼에서 최대값 - 최소값 연산하기 
df['A'].max() - df['A'].min()

10.653538675058591

In [60]:
#? 모든 컬럼의 최대값 - 최소값 연산하기

In [61]:
df.max() - df.min()

A    10.653539
B     2.767800
C     4.623937
D     1.296243
dtype: float64

In [62]:
# 사용자 정의 함수를 호출 또는 람다 표현식을 사용 가능한 DataFrame의 함수
# 최대값-최소값 : 각 컬럼별 데이터 파악 후 대소비교 후 연산
df.apply(lambda x : x.max() - x.min())

A    10.653539
B     2.767800
C     4.623937
D     1.296243
dtype: float64

In [63]:
# ? 이 apply()가 몇번 호출될지 파악하는 로직을 lambda로 단순 확인 해 보기
df.apply(lambda x : print(x))

2018-12-10    10.000000
2018-12-11    -0.653539
2018-12-12     2.115943
2018-12-13     0.247772
2018-12-14     0.087888
2018-12-15    -0.043940
Freq: D, Name: A, dtype: float64
2018-12-10    0.198447
2018-12-11   -1.622985
2018-12-12    0.332242
2018-12-13    1.144815
2018-12-14   -1.261223
2018-12-15   -0.461682
Freq: D, Name: B, dtype: float64
2018-12-10   -1.054903
2018-12-11    2.625608
2018-12-12    0.739265
2018-12-13   -0.083858
2018-12-14   -1.998329
2018-12-15    0.482143
Freq: D, Name: C, dtype: float64
2018-12-10   -0.846296
2018-12-11   -0.949073
2018-12-12   -0.944312
2018-12-13   -0.154837
2018-12-14   -1.451080
2018-12-15   -0.901022
Freq: D, Name: D, dtype: float64

A    None
B    None
C    None
D    None
dtype: object

이미 존재하는 파일의 내용을 기반으로 DataFrame 생성하기

In [64]:
# 외부 폴더의 file을 read -> DataFrame 객체 생성하기
'''
이 파일이 내장된 경로 : C:\0.ITStudy\9.Pandas\step01~
firends.csv : C:\0.ITStudy\0.dataSet\friends.csv
'''
df = pd.read_csv("../0.dataSet/friends.csv")
df

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [65]:
type(df)

pandas.core.frame.DataFrame

In [66]:
df['이름']

0    신동엽
1    유재석
2    김새롬
3    이영자
4    강호동
Name: 이름, dtype: object

In [67]:
#? 이영자 이름을 이영순으로 변경해 보기
df

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [68]:
df.iloc[3, 0]

'이영자'

In [69]:
df.iloc[3, 0] = '이영순'
df

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영순  45  상담사   talk
4  강호동  38  연예인   talk

In [70]:
df.loc[3, '이름']

'이영순'

In [71]:
df['이름'][3] = 'test'

C:\Users\Playdata\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [72]:
df

     이름  나이   직업  hobby
0   신동엽  20  연예인  music
1   유재석  41   교수    art
2   김새롬  18   학생  study
3  test  45  상담사   talk
4   강호동  38  연예인   talk

In [73]:
# tab으로 데이터를 구분한 파일의 내용으로 DataFrame 객체 생성하기
df = pd.read_csv("../0.dataSet/friendsTab.txt", delimiter="\t")
df

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

원천 데이터(raw)에 컬럼명으로 사용될 header 정보가 없을 경우 주의사항<br>
DataFrame 생성시 데이터의 첫 라인이 header 정보로 사용되지 
않게 속성으로 제어해야 함<br>
1단계 실습 : 신동엽 정보가 header 정보로 사용 -> colums 추가 
            -> 정보 손실<br>
2단계 실습 : 신동엽 정보 손실없이 작업<br>

In [74]:
# 1단계
# header 정보가 없는 파일을 read해서 가공하기
df = pd.read_csv("../0.dataSet/friendsTabNoHead.txt", delimiter="\t")
df

   신동엽  20  연예인  music
0  유재석  41   교수    art
1  김새롬  18   학생  study
2  이영자  45  상담사   talk
3  강호동  38  연예인   talk

In [75]:
df.columns

Index(['신동엽', '20', '연예인', 'music'], dtype='object')

In [76]:
df.columns = ['name','age','job', 'hobby']

In [77]:
df

  name  age  job  hobby
0  유재석   41   교수    art
1  김새롬   18   학생  study
2  이영자   45  상담사   talk
3  강호동   38  연예인   talk

In [78]:
# 2단계
df = pd.read_csv("../0.dataSet/friendsTabNoHead.txt", delimiter="\t", header=None)
df

     0   1    2      3
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [79]:
df.columns = ['name', 'age', 'job', 'hobby']
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [80]:
# 3단계 - DataFrame 생성 시점에 컬럼명 반영 가능
df = pd.read_csv("../0.dataSet/friendsTabNoHead.txt", 
                 delimiter="\t", header=None,
                 names=['name', 'age', 'job', 'hobby'])
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

python data 타입으로 부터 DataFrame 생성 및 가공

In [81]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'}]

In [82]:
friend_dict_list

[{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
 {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
 {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
 {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
 {'name': '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'}]

In [83]:
type(friend_dict_list)

list

In [84]:
friend_dict_list[0]

{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'}

In [85]:
friend_dict_list[0]['name']

'신동엽'

In [86]:
type(friend_dict_list[0]['name'])

str

In [87]:
df = pd.DataFrame(friend_dict_list)
df

   age  hobby  job name
0   20  music  연예인  신동엽
1   41    art   교수  유재석
2   18  study   학생  김새롬
3   45   talk  상담사  이영자
4   38   talk  연예인  강호동

In [88]:
friend_dict_list

[{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
 {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
 {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
 {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
 {'name': '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'}]

In [89]:
df.name

0    신동엽
1    유재석
2    김새롬
3    이영자
4    강호동
Name: name, dtype: object

In [90]:
type(df.name)

pandas.core.series.Series

In [91]:
df.head()

   age  hobby  job name
0   20  music  연예인  신동엽
1   41    art   교수  유재석
2   18  study   학생  김새롬
3   45   talk  상담사  이영자
4   38   talk  연예인  강호동

In [92]:
df.tail()

   age  hobby  job name
0   20  music  연예인  신동엽
1   41    art   교수  유재석
2   18  study   학생  김새롬
3   45   talk  상담사  이영자
4   38   talk  연예인  강호동

In [93]:
df.head(2)

   age  hobby  job name
0   20  music  연예인  신동엽
1   41    art   교수  유재석

In [94]:
df

   age  hobby  job name
0   20  music  연예인  신동엽
1   41    art   교수  유재석
2   18  study   학생  김새롬
3   45   talk  상담사  이영자
4   38   talk  연예인  강호동

In [95]:
df = df[['name', 'age', 'job', 'hobby']]

In [96]:
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [97]:
#? df2 라는 변수한테 friend_dict_list가 보유한 일반 python의 list로 
# DataFrame 생성, 단 컬럼 순서는 name age job hobby 순으로 생성 
#? 생성 시점에 컬럼순서 정할수 있나?
df2 = pd.DataFrame(friend_dict_list, 
                   columns=['name', 'age', 'job', 'hobby'],
                   index=['영', '일', '이', '삼', '사'])

In [98]:
df2

  name  age  job  hobby
영  신동엽   20  연예인  music
일  유재석   41   교수    art
이  김새롬   18   학생  study
삼  이영자   45  상담사   talk
사  강호동   38  연예인   talk

정제한 DataFrame을 csv 파일로 생성하기

In [99]:
df2

  name  age  job  hobby
영  신동엽   20  연예인  music
일  유재석   41   교수    art
이  김새롬   18   학생  study
삼  이영자   45  상담사   talk
사  강호동   38  연예인   talk

In [100]:
df2.to_csv("../0.dataSet/f1_out.csv", index=None)

In [101]:
#? 컬럼명도 배제해서 f2_out.csv 생성해 보기 
# header=None
df2.to_csv("../0.dataSet/f2_out.csv", index=None, header=None)

In [102]:
df2

  name  age  job  hobby
영  신동엽   20  연예인  music
일  유재석   41   교수    art
이  김새롬   18   학생  study
삼  이영자   45  상담사   talk
사  강호동   38  연예인   talk

In [103]:
#리스트로 데이터 프레임 생성하기 + header 추가 하기
friends = [['신동엽',20,'연예인','music'], 
           ['유재석',41,'교수','art'], 
           ['김새롬',18,'학생','study'], 
           ['이영자',45,'상담사','talk'], 
           ['강호동',38,'연예인','talk']]

df = pd.DataFrame.from_records(friends)

In [104]:
df

     0   1    2      3
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [105]:
df.columns=['name', 'age', 'job', 'hobby']

In [106]:
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [107]:
df['salary'] = 0
df

  name  age  job  hobby  salary
0  신동엽   20  연예인  music       0
1  유재석   41   교수    art       0
2  김새롬   18   학생  study       0
3  이영자   45  상담사   talk       0
4  강호동   38  연예인   talk       0

In [108]:
# job이 학생인 경우 salary값이 yes, 학생인 경우 no값으로 치환 하기
# np.where()
'''
    salary 컬럼에 no or yes 대입 : df['salary'] = 'no' or 'yes'
    
    상황에 따른 조건 job 학생? non-학생? : df['job'] != '학생'
    
    삼항연산자
        보편적인 프로그램 언어 문법 = 조건식?true일때:false일때        
'''

"\n    salary 컬럼에 no or yes 대입 : df['salary'] = 'no' or 'yes'\n    \n    상황에 따른 조건 job 학생? non-학생? : df['job'] != '학생'\n    \n    삼항연산자\n        보편적인 프로그램 언어 문법 = 조건식?true일때:false일때        \n"

In [109]:
df['salary'] = np.where(df['job'] != '학생', 'yes', 'no')

In [110]:
df

  name  age  job  hobby salary
0  신동엽   20  연예인  music    yes
1  유재석   41   교수    art    yes
2  김새롬   18   학생  study     no
3  이영자   45  상담사   talk    yes
4  강호동   38  연예인   talk    yes

중복 데이터 처리 기술

1. 1단계 - 100% 모든 데이터 동일한 것으로 test
- 2단계 - age 컬럼값만 다를 경우 중복이 아님 확인

In [111]:
# step01
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'} ]

df = pd.DataFrame(friend_dict_list)
df = df[['name', 'age', 'job', 'hobby']]
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [112]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [113]:
df = df.drop_duplicates()
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [114]:
# step02
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': 21, 'job': '연예인', 'hobby':'music'} ]

df = pd.DataFrame(friend_dict_list)
df = df[['name', 'age', 'job', 'hobby']]
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   21  연예인  music

In [115]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [116]:
df.drop_duplicates()
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   21  연예인  music

In [119]:
# step03 - 컬럼 데이터만을 기준으로 중복 여부 확인 후에 삭제 가능
df.drop_duplicates(['name'], keep='first')

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [127]:
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   21  연예인  music

In [128]:
df.drop_duplicates(['name'], keep='last')

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   21  연예인  music

In [129]:
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   21  연예인  music

In [130]:
# inplace=True : 원본 DataFrame에 영향을 주는 속성
df.drop_duplicates(['name'], keep='last', inplace=True)

In [131]:
df

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   21  연예인  music

결측치 처리하기

In [193]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby':'music'} ]

df = pd.DataFrame(friend_dict_list)
df = df[['name', 'age', 'job', 'hobby']]

In [194]:
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [195]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
name     6 non-null object
age      5 non-null float64
job      6 non-null object
hobby    6 non-null object
dtypes: float64(1), object(3)
memory usage: 272.0+ bytes

In [196]:
# 결측치 확인 함수, 결측치인 경우에만 True
df.isna() #df.isnull()

    name    age    job  hobby
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False   True  False  False

In [197]:
df.isnull()

    name    age    job  hobby
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False   True  False  False

In [198]:
#? 모든 친구들의 age의 합? 평균?
df['age'].sum()

162.0

In [199]:
df['age']

0    20.0
1    41.0
2    18.0
3    45.0
4    38.0
5     NaN
Name: age, dtype: float64

In [200]:
df['age'].mean()

32.4

In [201]:
'''
  non 값을 0으로 치환, 평균을 제대로 도출
'''
df['age'].fillna(0)

0    20.0
1    41.0
2    18.0
3    45.0
4    38.0
5     0.0
Name: age, dtype: float64

In [202]:
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [190]:
df['age'].fillna(0, inplace=True)

In [191]:
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   0.0  연예인  music

In [192]:
df['age'].mean()

27.0

In [6]:
import numpy as np
import pandas as pd

In [15]:

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby':'music'} ]

df = pd.DataFrame(friend_dict_list)
df = df[['name', 'age', 'job', 'hobby']]

In [16]:
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [17]:
# age 컬럼의 결측치 NaN 부분을 0으로 변경해 보기(원본 수정 불가 )
df['age'].fillna(0)

0    20.0
1    41.0
2    18.0
3    45.0
4    38.0
5     0.0
Name: age, dtype: float64

In [18]:
type(df['age'].fillna(0))

pandas.core.series.Series

In [19]:
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [28]:
# job별로 그룹화 한 상태의 job별로 age의 평균을 구해서 두번째 동명이인의 신동엽에게 대입
'''
1. 결측치가 있다는 가정하에 예제
2. 결측치가 정리가 된 상태에서는 평균 산출로 변환
'''
df['age'].fillna(df.groupby("job")['age'].transform('median'),
                 inplace=True)

In [30]:
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽  29.0  연예인  music

In [31]:
df.groupby("job")

In [32]:
df.groupby("job")['age']

중복 데이터 관련된 unique 처리 기술 학습

1. db의 distinct와 같은 기능 학습
- oracle db의 emp의 job의 종류가 중복되지 않게 검색
- select distinct job from emp;

In [34]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' : '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                     {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby':'music'},
                     {'name': '고현정', 'age': 44, 'job': '가수', 'hobby':'music'},
                     {'name': '박민영', 'age': 22, 'job': '학생', 'hobby':'art'},
                     {'name': '박서준', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '박보검', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' : '이효리', 'age' : 28, 'job' : '교수', 'hobby' : 'talk'},
                    {'name': '이상순', 'age': 29, 'job': '주부', 'hobby':'music'}]

df = pd.DataFrame(friend_dict_list)
df = df[['name', 'age', 'job', 'hobby']]

In [35]:
df

   name   age  job  hobby
0   신동엽  20.0  연예인  music
1   유재석  41.0   교수    art
2   김새롬  18.0   학생  study
3   이영자  45.0  상담사   talk
4   강호동  38.0  연예인   talk
5   신동엽   NaN  연예인  music
6   고현정  44.0   가수  music
7   박민영  22.0   학생    art
8   박서준  18.0   학생  study
9   박보검  45.0  상담사   talk
10  이효리  28.0   교수   talk
11  이상순  29.0   주부  music

In [36]:
print(df.job)

0     연예인
1      교수
2      학생
3     상담사
4     연예인
5     연예인
6      가수
7      학생
8      학생
9     상담사
10     교수
11     주부
Name: job, dtype: object

In [38]:
print(df.job.unique())

['연예인' '교수' '학생' '상담사' '가수' '주부']

In [39]:
type(df.job)

pandas.core.series.Series

In [40]:
df.job.unique()

array(['연예인', '교수', '학생', '상담사', '가수', '주부'], dtype=object)

In [44]:
type(df.job.unique())

numpy.ndarray

In [45]:
df.job.value_counts()

학생     3
연예인    3
교수     2
상담사    2
가수     1
주부     1
Name: job, dtype: int64

In [46]:
type(df.job.value_counts())

pandas.core.series.Series

In [47]:
# hobby에 대해서 종류 검색 -> 개수 파악 -> hoboy별 인원수 파악
df['hobby'].unique()

array(['music', 'art', 'study', 'talk'], dtype=object)

In [49]:
type(df['hobby'].unique())

numpy.ndarray

In [50]:
len(df['hobby'].unique())

4

In [51]:
df.hobby.value_counts()

music    4
talk     4
study    2
art      2
Name: hobby, dtype: int64

두개의 DataFrame 병합하기 - row 기준

In [53]:
l1 = [{'name': '이효리', 'job': "교수"},
      {'name': '이상순', 'job': "학생"},
      {'name': '박보검', 'job': "개발자"}]

l2 = [{'name': '신동엽', 'job': "치과의사"},
      {'name': '이영자', 'job': "농부"},
      {'name': '정찬우', 'job': "연예인"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [54]:
l1

[{'name': '이효리', 'job': '교수'},
 {'name': '이상순', 'job': '학생'},
 {'name': '박보검', 'job': '개발자'}]

In [55]:
df1

  name  job
0  이효리   교수
1  이상순   학생
2  박보검  개발자

In [56]:
type(l1)

list

In [57]:
type(df1)

pandas.core.frame.DataFrame

In [58]:
df1

  name  job
0  이효리   교수
1  이상순   학생
2  박보검  개발자

In [59]:
df2

  name   job
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [60]:
df3 = [df1, df2]
df3

[  name  job
 0  이효리   교수
 1  이상순   학생
 2  박보검  개발자,   name   job
 0  신동엽  치과의사
 1  이영자    농부
 2  정찬우   연예인]

In [62]:
df4 = pd.concat(df3)
df4

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [64]:
df5 = pd.concat(df3, ignore_index=True)
df5

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
3  신동엽  치과의사
4  이영자    농부
5  정찬우   연예인

두개의 DataFrame 병합하기 - column 기준

In [66]:
l1 = [{'name': '이효리', 'job': "교수"},
      {'name': '이상순', 'job': "학생"},
      {'name': '박보검', 'job': "개발자"}]

l2 = [{'name': '신동엽', 'job': "치과의사"},
      {'name': '이영자', 'job': "농부"},
      {'name': '정찬우', 'job': "연예인"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [68]:
df3 = [df1, df2]
df3

[  name  job
 0  이효리   교수
 1  이상순   학생
 2  박보검  개발자,   name   job
 0  신동엽  치과의사
 1  이영자    농부
 2  정찬우   연예인]

In [69]:
df4 = pd.concat(df3, axis=1, ignore_index=True)

In [70]:
df4

     0    1    2     3
0  이효리   교수  신동엽  치과의사
1  이상순   학생  이영자    농부
2  박보검  개발자  정찬우   연예인

In [71]:
#? 컬럼 순서를 0 3 2 1 순서 변경해 보기 
df4 = df4[[0, 3, 2, 1]]
df4

     0     3    2    1
0  이효리  치과의사  신동엽   교수
1  이상순    농부  이영자   학생
2  박보검   연예인  정찬우  개발자

In [75]:
#? 컬럼명 수정  name, job
df4.columns=['name','job','name','job']
df4

  name   job name  job
0  이효리  치과의사  신동엽   교수
1  이상순    농부  이영자   학생
2  박보검   연예인  정찬우  개발자

In [94]:
#? 
dataOne = df4.iloc[:, [0, 1]]
dataOne

  name   job
0  이효리  치과의사
1  이상순    농부
2  박보검   연예인

In [95]:
dataTwo = df4.iloc[:, [2, 3]]
dataTwo

  name  job
0  신동엽   교수
1  이영자   학생
2  정찬우  개발자

In [96]:
dataTotal = [dataOne, dataTwo]
dataTotal

[  name   job
 0  이효리  치과의사
 1  이상순    농부
 2  박보검   연예인,   name  job
 0  신동엽   교수
 1  이영자   학생
 2  정찬우  개발자]

In [97]:
finallData = pd.concat(dataTotal, ignore_index=True)
finallData

  name   job
0  이효리  치과의사
1  이상순    농부
2  박보검   연예인
3  신동엽    교수
4  이영자    학생
5  정찬우   개발자

문제1 : 학생들의 중간, 기말 고사 성적만으로 '총점'과 '평점' 추가하기

In [98]:
friend_dict_list = [{'이름': '나학생1', '중간고사점수': 95, '기말고사점수': 85},
         {'이름': '나학생2', '중간고사점수': 85, '기말고사점수': 80},
         {'이름': '나학생3', '중간고사점수': 10, '기말고사점수': 30}]

df = pd.DataFrame(friend_dict_list, columns = ['이름', '중간고사점수', '기말고사점수'])
df

     이름  중간고사점수  기말고사점수
0  나학생1      95      85
1  나학생2      85      80
2  나학생3      10      30

In [100]:
df['총점'] = df['중간고사점수']+df['기말고사점수']
df

     이름  중간고사점수  기말고사점수   총점
0  나학생1      95      85  180
1  나학생2      85      80  165
2  나학생3      10      30   40

In [104]:
df['평균'] = (df['총점']/2).astype(int)
df

     이름  중간고사점수  기말고사점수   총점  평균
0  나학생1      95      85  180  90
1  나학생2      85      80  165  82
2  나학생3      10      30   40  20

In [107]:
for v in df:
    print(v)

이름
중간고사점수
기말고사점수
총점
평균

In [110]:
for key, value in df.iteritems():
    print(key, ' ', value)

이름   0    나학생1
1    나학생2
2    나학생3
Name: 이름, dtype: object
중간고사점수   0    95
1    85
2    10
Name: 중간고사점수, dtype: int64
기말고사점수   0    85
1    80
2    30
Name: 기말고사점수, dtype: int64
총점   0    180
1    165
2     40
Name: 총점, dtype: int64
평균   0    90
1    82
2    20
Name: 평균, dtype: int32

In [112]:
df

     이름  중간고사점수  기말고사점수   총점  평균
0  나학생1      95      85  180  90
1  나학생2      85      80  165  82
2  나학생3      10      30   40  20

In [113]:
for key, value in df.iterrows():
    print(key, ' ', value)

0   이름        나학생1
중간고사점수      95
기말고사점수      85
총점         180
평균          90
Name: 0, dtype: object
1   이름        나학생2
중간고사점수      85
기말고사점수      80
총점         165
평균          82
Name: 1, dtype: object
2   이름        나학생3
중간고사점수      10
기말고사점수      30
총점          40
평균          20
Name: 2, dtype: object

문제2 : DataFrame도 반복문으로 처리 가능
평균값을 반복문(for)  활용해서 출력해 보기

In [105]:
for avg in df.평균:
    print(avg)

90
82
20

문제3 : grade(등급) 이라는 컬럼 추가, 90점이상(A), 80점이상(B), 그외 F등급
조건식 활용해서 파이썬 코드로 처리해 보기

In [114]:
grade = []
for avg in df['평균']:
    if avg >= 90:
        grade.append('A')
    elif avg >= 80:
        grade.append('B')
    else:
        grade.append('F')
df['등급'] = grade
df

     이름  중간고사점수  기말고사점수   총점  평균 등급
0  나학생1      95      85  180  90  A
1  나학생2      85      80  165  82  B
2  나학생3      10      30   40  20  F

문제4:'이수여부'라는 컬럼을 추가하되 등급을 기준으로 
       F인 경우 fail/F가 아닌 경우 pass 값으로 반영
       단 lambda 문법으로 처리해 보기

In [117]:
df['이수여부'] = df['등급'].apply(lambda v : 'pass' if v != 'F' else 'fail')
df

     이름  중간고사점수  기말고사점수   총점  평균 등급  이수여부
0  나학생1      95      85  180  90  A  pass
1  나학생2      85      80  165  82  B  pass
2  나학생3      10      30   40  20  F  fail

In [115]:
test = lambda v : 'pass' if v != 'F' else 'fail'
test('A')

'pass'

test('F')

In [ ]:
if v != 'F':
    return 'pass'
else:
    return 'fail'

문제5: apply 할수를 사용해서 년월일 정보에서 년에 해당하는 정보만  반환

In [118]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2018-12-20'}]

df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2018-12-20

In [119]:
df['yyyy-mm-dd']

0    2000-06-27
1    2002-09-24
2    2018-12-20
Name: yyyy-mm-dd, dtype: object

In [121]:
'2000-06-27'.split('-')

['2000', '06', '27']

In [122]:
for v in df['yyyy-mm-dd']:
    print(v)

2000-06-27
2002-09-24
2018-12-20

In [123]:
for v in df['yyyy-mm-dd']:
    print(type(v))

<class 'str'>
<class 'str'>
<class 'str'>

In [124]:
for v in df['yyyy-mm-dd']:
    print(v.split('-'))

['2000', '06', '27']
['2002', '09', '24']
['2018', '12', '20']

In [128]:
for v in df['yyyy-mm-dd']:
    print(type(v.split('-')[0]))
    print(v.split('-')[0])

<class 'str'>
2000
<class 'str'>
2002
<class 'str'>
2018

In [126]:
'''
    사용 정의 함수 개발 -> apply()에서 호출 
    호출 문법 : apply(함수명)
'''
def getYear(row):    
    return row.split('-')[0]

df['year'] = df['yyyy-mm-dd'].apply(getYear)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2018-12-20  2018

In [129]:
def getAge(year, currentYear):
    return currentYear - int(year)
df['age'] = df['year'].apply(getAge, currentYear=2018)
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-24  2002   16
2  2018-12-20  2018    0

In [130]:
def getInfo(age, prefix, suffix):
    return prefix + str(age) + suffix

In [131]:
df['info'] = df['age'].apply(getInfo, prefix="내 나이는 ", suffix=" 살")
df

   yyyy-mm-dd  year  age        info
0  2000-06-27  2000   18  내 나이는 18 살
1  2002-09-24  2002   16  내 나이는 16 살
2  2018-12-20  2018    0   내 나이는 0 살

In [132]:
student_list = [{'name': 'John', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Abraham', 'major': "Physics", 'gender': "male"},
                {'name': 'Brian', 'major': "Psychology", 'gender': "male"},
                {'name': 'Janny', 'major': "Economics", 'gender': "female"},
                {'name': 'Yuna', 'major': "Economics", 'gender': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'gender': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Zara', 'major': "Psychology", 'gender': "female"},
                {'name': 'Wendy', 'major': "Economics", 'gender': "female"},
                {'name': 'Sera', 'major': "Psychology", 'gender': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'gender'])
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [133]:
groupby_major = df.groupby('major')
groupby_major

In [134]:
# 그룹별 정보 확인 속성
groupby_major.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [142]:
#그룹 변수는 각 컬럼명 사용 가능
# 호출 가능 속성명 : name/major/gender
groupby_major.major

In [143]:
'''
name 변수 : 변수명 가변적
            보유하게 되는 데이터값은 grouping된 데이터 이름
group 변수 : 변수명 가변적
             보유하게 되는 데이터
             해당 그룹에 소속된 index와 각 컬럼명 데이터들           
'''
for name, group in groupby_major:
    print(name + ' : ' + str(len(group)))

Computer Science : 4
Economics : 3
Physics : 1
Psychology : 3

In [137]:
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [139]:
for n, g in groupby_major:
    print(n + ' : ' + str(len(g)))

Computer Science : 4
Economics : 3
Physics : 1
Psychology : 3

In [146]:
for name, group in groupby_major:
    print(name + ' : ' + str(len(group)))
    print(group)
    print()

Computer Science : 4
       name             major  gender
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics : 3
    name      major  gender
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics : 1
      name    major gender
2  Abraham  Physics   male

Psychology : 3
     name       major  gender
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [147]:
groupby_major.size()

major
Computer Science    4
Economics           3
Physics             1
Psychology          3
dtype: int64

그룹 객체를 새로운 DataFrame 객체로 생성해 보기

In [148]:
# index도 없고, count라는 컬럼명 위치도 정리 필요 구조
# DataFrame 내에 존재하는 reset_index()로 재정리하기
df2 = pd.DataFrame({'count' : groupby_major.size()})
df2

                  count
major
Computer Science      4
Economics             3
Physics               1
Psychology            3

In [149]:
df3 = pd.DataFrame({'count' : groupby_major.size()}).reset_index()
df3

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [150]:
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

마지막 문제 <br>
1. gender별로 그룹화 하기
- 그룹 단위로 이름, 전공, 성별 구조로 출력하기
- 성별 인원수로 새로운 DatFrame 생성하기(count라는 컬럼명 추가)

In [152]:
groupby_gender = df.groupby('gender')

In [153]:
for name, group in groupby_gender:
    print(name + ": " + str(len(group)))
    print(group)
    print()

female: 6
        name             major  gender
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male: 5
      name             major gender
0     John  Computer Science   male
1     Nate  Computer Science   male
2  Abraham           Physics   male
3    Brian        Psychology   male
7   Edward  Computer Science   male

In [154]:
df5 = pd.DataFrame({'count' : groupby_gender.size()}).reset_index()
df5

   gender  count
0  female      6
1    male      5